app/controllers/users_controller.rb

  def create
     @user = User.new(user_params)    # 実装は終わっていないことに注意!
     if @user.save
---
INSERT INTO "users" ("created_at", "email", "name", "password_digest", "updated_at") VALUES (?, ?, ?, ?, ?)